{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "Documentation",
      "DisplayName": "Documentation"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 3,
    "Custom": null,
    "Description": "(Will update as additional issues are found.)\r\n\r\nOn page 29, I'd argue that the link for the store should be /Store, without the trailing slash, since MVC doesn't include a trailing slash when it generates links. Best to have new users be consistent in how they're linking to content.\r\n\r\nOn page 32 (not on the Web), the added code is missing color styling. The same issues is on the top of page 33, for the new Title property.\r\n\r\nOn page 33, I believe StoreControllers should be StoreController's, with only StoreController in bold. Issue is also on the Web.\r\n\r\nOn page 34 (also on the Web), the last sentence says the file will be generated in \\Views\\Store\\Index.cshtml, but that should be \\Details.cshtml.\r\n\r\nOn the bottom of page 40 the scaffolding feature is discussed, as well as mention that it generates links to edit, details, and delete. However, since the scaffolding template item in the 'Add View' dialog hasn't even been mentioned, this seems more confusing than beneficial, at this point.\r\n\r\nOn page 43, there will not be a space (or newline, on the Web site) between the closing a and li elements.\r\n\r\nOn page 45 (also on the Web), SQL Server Express database files are referred to, but the tutorial is now using Compact Edition databases.\r\n\r\nAs already mentioned, on page 46 the name of the connection string should be MusicStoreEntities instead of MovieDBContext. I also find it odd that this being added at the bottom of the configuration file, instead of after appSettings, which is typically the norm.\r\n\r\nThe screenshot at the top of page 47 is missing the Artist class in the Models directory.\r\n\r\nAlso on page 47, the Artists table should be defined in the same block of code as the Albums and Genres. (Currently added on page 90 instead.)\r\n\r\nOn page 63, the first code snippet is missing color styling.\r\n\r\nOn page 77, it might be beneficial to say something more about virtual properties and/or lazy loading. Lazy loading is good, because ...\r\n\r\nAlso on page 77, the second to last sentence on the page should have \"Album Art URL\" instead of \"Album Art Url.\"\r\n\r\nOn page 81, the materials from the assets zip use 'Mvc3ToolsUpdateWeb_Default' within their namespace, which requires the using statements to be updated as well. So that's the controller, model, and 3 of the 4 views.\r\n\r\nPage 89 and 90 both have System.DateTime instead of simply DateTime.\r\n\r\nOn page 89, the Order class specifies a using for System.Collections.Generic, but that's by default already added to the class.\r\n\r\nLikewise, on page 90 the using System.Data.Entity has already been added previously, so isn't need here.\r\n\r\nOn page 96, the using System.Collections.Generic is not required.\r\n\r\nOn page 99, before adding the Shopping Cart Index view, there should be a note about doing a build so the ViewModel models display.\r\n\r\nOn page 100, it would probably be better for the Scaffold template to be Details or Empty, instead of List.\r\n\r\nOn page 101, the addition of jQuery is unnecessary (although it does provide Intellisense support).\r\n\r\nOn page 113, the AccountController is already using MvcMusicStore3.Models, if copied from the assets.\r\n\r\nAlso on page 113, 'UserName' should be 'userName' for MigrateShoppingCart.\r\n\r\nOn page 114, the MigrateShoppingCart addition is not highlighted.\r\n\r\nOn page 116, instead of checking against false the standard is typically to just do !string.Equals().\r\n\r\nOn page 121, we're told to create a new Order class in Models, even though one already exists, and we should just be updating it. Class doesn't need to be updated to a partial for that reason as well. (Originally created on page 89.)\r\n\r\nOn page 128 it might be beneficial to order the genres by name. But the full listing isn't, so for consistency it should be one way or the other.",
    "LastUpdatedDate": "2017-11-28T07:20:36.717-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "mvcmusicstore",
    "ReportedDate": "2011-04-24T10:18:29.16-07:00",
    "Status": {
      "Name": "Active",
      "Id": 2
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Version 3.0 beta (4/13/2011) styling/font issues",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 6646
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Dear strivinglife,\n\nI'm curious about the issue on page 81.\nI too am stuck at this part of the tutorial and whenever I compile it and debug with F5, I get an error saying \"The type or namespace name 'Mvc3Mvc3ToolsUpdateWeb_Default' could not be found (are you missing a using directive or an assembly reference?).\nAre you suggesting that I copy \"Using Mvc3ToolsUpdateWeb_Default.Models;\" to all the other files as well?",
      "PostedDate": "2011-10-16T23:33:25.983-07:00",
      "Id": 47083
    },
    {
      "Message": "@theOtherSid - It looks like you skipped this step: \nThe AccountController class should use the MvcMusicStore.Controllers namespace, and the AccountModels class should use the MvcMusicStore.Models namespace.\nYour controller's 'using' statement is referencing the wrong namespace, switch it to match the model's namespace.",
      "PostedDate": "2012-02-15T07:19:16.103-08:00",
      "Id": 56043
    },
    {
      "Message": "@theOtherSid - To solve this problem you just need to change the first line of all cshtml page of ACCOUNT View and replace \"Mvc3ToolsUpdateWeb_Default\" to \"MvcMusicStore\" .",
      "PostedDate": "2013-08-06T23:46:47.29-07:00",
      "Id": 108793
    }
  ]
}