{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 8,
    "Custom": null,
    "Description": "If you use decimal comma ,  as separator for the price the application does not work.\r\n\r\nAs a major example for MVC 3 I thinnk it would be nice if the part of the world that use decimal comma could use this application.\r\nhttp://en.wikipedia.org/wiki/File:DecimalSeparator.svg\r\n",
    "LastUpdatedDate": "2012-06-06T12:58:13.147-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "mvcmusicstore",
    "ReportedDate": "2011-01-14T09:53:23.633-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Does not work with decimal comma as decimal separator",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 7,
    "Id": 6623
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Olsmar, thanks for reporting this. Can you point out some of the areas that are broken? I'd like to get that fixed for the next version.",
      "PostedDate": "2011-01-14T10:26:09.807-08:00",
      "Id": 26651
    },
    {
      "Message": "The problem is in the price field validation. \nAs the jquery.validate does not handle decimal comma.\nThis \"error\" is present in both Step by Step Tutorials for MVC 3. \nI hope that Microsoft like to be a global company and give some advice to \"my\" half of the world.\nOr at least mention that it does not work for the decimal comma world.\nJan\n",
      "PostedDate": "2011-01-16T04:47:12.37-08:00",
      "Id": 26696
    },
    {
      "Message": "I've not read the full Tutorial yet, but I've run into this at pg. 76 (the part where it starts to be possible to edit an album and save it into the database by navigating to /StoreManager/Edit/5), the price text box will display \"8,99\" (which is correct for my locale) but if you tab out of said text box it'll show \"The field Price must be a number\". If you change the value to \"8.99\" (incorrect, but I was trying to please the application) it'll tab out OK but throw when you Submit (at method call TryUpdateModel) and report that \"The value '8.99' is not valid for Price.\"\nThere are plenty of blog posts out there about globalization but I too think such situation should be handled (or at least noted) in the Tutorial.",
      "PostedDate": "2011-03-06T09:40:54.703-08:00",
      "Id": 30078
    },
    {
      "Message": "Here the same problem.\nIf I use the Range validation in Price I can't use dot or comma as decimal separator.\n\nI added the script methods_de.js and linked it in the Create.cshmtl file in order to fix the problem and it works if I don't use range validation in the album class. \n\nAny idea? :) Thanks for the tutorial.",
      "PostedDate": "2011-04-07T04:47:15.02-07:00",
      "Id": 33719
    },
    {
      "Message": "Hey Jon,\n\nTake a look at this page: http://rebuildall.umbraworks.net/2011/03/02/jQuery_validate_and_the_comma_decimal_separator\n\nThis was the solution I used for my multilanguage Brazilian Portuguese/English ASP.NET MVC 3 application. It fixes both the Numeric and Range jQuery validators. Here in Brazil we also use comma ( , ) to separate decimal values.\n\nI hope this gets fixed for the next version of ASP.NET MVC that by the way is a fantastic programming model. Keep it evolving! :D\n\nRegards,\n\nLeniel Macaferi\nhttp://leniel.net",
      "PostedDate": "2011-04-24T21:11:18.743-07:00",
      "Id": 34738
    },
    {
      "Message": "Same problem here in Sweden. Including 'methods_de.js' solves part of the problem but the Range annotation is still broken. I wrote a custom annotation to replace the standard-issue Range annotation and it works fine, so I don't know why the standard Range annotation doesn't work.",
      "PostedDate": "2011-10-07T02:47:07.507-07:00",
      "Id": 46309
    },
    {
      "Message": "Problem not solved in either MusicStore or jquery.validate yet :-D\n\nStill using this javascript code to override the default jquery.validate:\nhttp://rebuildall.umbraworks.net/2011/03/02/jQuery_validate_and_the_comma_decimal_separator\n\nThat solves the comma separator problem.",
      "PostedDate": "2012-03-13T14:12:09.59-07:00",
      "Id": 57643
    },
    {
      "Message": "If this is similar to the MVCMovies, this here contains an answer: http://stackoverflow.com/questions/5199835/mvc-3-jquery-validation-globalizing-of-number-decimal-field. I also wrote an article about it in German here http://www.andreas-reiff.de/2012/06/probleme-mit-mvcmovies-beispiel-validierung-des-preises-mit-dezimalstellen-schlagt-fehl/.",
      "PostedDate": "2012-06-06T12:58:13.147-07:00",
      "Id": 67476
    }
  ]
}