{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 1,
    "Custom": null,
    "Description": "Hi, my code for MvcMusicStore was working really well, I'm able to list all the Albums, Genres etc....The Edit, Details and Delete functionalities was working great as well. When I reached part 6 and added the changes or Data Annotations for Albums.cs model I started having issues. First on /Store the list of Genres was showing \"Select from 0 genres:\". Second, on /StoreManager/Index it only shows the headers but again the list is empty. I didn't make any changes to the SampleData.cs I just followed every step on the tutorial. One thing I noticed was on the MusicStoreEntities.cs it didn't say that I have to add the Artists DbSet, I just had to add it cause the code won't build.\r\nPlease help with this, I really want to finish the tutorial and now I'm stuck.",
    "LastUpdatedDate": "2012-01-17T00:28:03.413-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "mvcmusicstore",
    "ReportedDate": "2012-01-16T21:17:32.147-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Data Missing after adding Data Annotations",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 6672
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Okay here's how I fixed this issue. I wanted to just delete the MvcMusicStore.sdf so all the data would be refreshed but I had no luck finding the file. What I did was to delete the App_Data folder from the Project explorer and then rebuilt the app. Then I ran the app again and everything worked well.",
      "PostedDate": "2012-01-17T00:28:03.413-08:00",
      "Id": 52799
    }
  ]
}