{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 7,
    "Custom": null,
    "Description": "I agree with others who appreciate the work of creating this tutorial for us since there is a dearth of book available. I have had some difficulties because I've never used MVC so it's taking a while to understand everything. I'm now at page 62 and started getting errors after adding the Album class.\r\n \r\nAt the end of page 62 it says the Create and Debit screens begin validating fields but I get errors when I try them.\r\n \r\nFor StoreManager/Create I'm Getting this error - \"This property cannot be set to a null value\"\r\nFor this line - _Title = StructuralObject.SetValidValue(value, false);\r\n \r\nAnd no red error messages.\r\n \r\nAnd it's crashing for StoreManager/Edit\r\n\r\nDid I miss something or do something wrong? One of my friends is having a similar problem.\r\n\r\nThanks",
    "LastUpdatedDate": "2010-10-25T16:26:18.903-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "mvcmusicstore",
    "ReportedDate": "2010-07-06T07:31:16.823-07:00",
    "Status": {
      "Name": "Resolved",
      "Id": 7
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Album Class",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 6604
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Jon, I also appreciate your work in putting this tutorial together.  I am experiencing the same issue as JMPlex.",
      "PostedDate": "2010-07-15T07:39:29.837-07:00",
      "Id": 14558
    },
    {
      "Message": "You will see an exception when you only have server-side validation hooked up. That's expected. If you hit F5 to continue executing, you'll see the page display. The next part of the tutorial hooks up Client-Side Validation, and you'll stop seeing exceptions since the validation errors will be handled on the client. Make sense?",
      "PostedDate": "2010-07-23T22:31:01.433-07:00",
      "Id": 14685
    },
    {
      "Message": "I was having the same problem and I continued on through the next couple of pages to set up client side validation. I have tried the javascript references in both the master page and in the album editor template and have added enableclientvalidation into both create and edit.aspx but it still blows at the same place, but displays properly after F5 is used. Is there some kind of previous setting that I could have missed? Is there a setting in IE8 that could be preventing this from working properly?",
      "PostedDate": "2010-07-30T05:35:21.943-07:00",
      "Id": 14844
    },
    {
      "Message": "Thanks Jon, as you said, after setting up the Client-Side Validation, all is well.",
      "PostedDate": "2010-07-31T05:16:11.313-07:00",
      "Id": 14857
    },
    {
      "Message": "@jongallaway, first at all i want to say thank you for this great tutorial, this is a great way to learn this new technology.\n\ni bing everywhere trying to find a deeper detail answer on why i get this exception, i know that by pressing F5 it will make the server-validation work or by running the the solution with ctrl+f5, i even had a break point on the HTTPOST create and it get hit after it go through the edmx so it make it feel like a late binding is this something normal? I thought that by using partial classes the compiler with merge this two into one at runtime. I know that the client validation won't make it work and even do this is just a sample I don't want to relay on client validation and yes even do the server-validation will work i just wondering why ain't kicking on debug mode?",
      "PostedDate": "2010-08-17T19:21:08.12-07:00",
      "Id": 15354
    },
    {
      "Message": "The reasons are confusing, but that exception is expected. Nothing's wrong with your code, and everything is working as it should.\n\nEntity Framework throws exceptions when checking constraints, and MVC handles them. When you run without debugging, or just hit F5 when the exception occurs, you'll see that the page is rendered. Visual Studio breaks on the exception because the Entity Framework code is a generated C# class in your project, so it's technically \"your code\", and the default behavior for Visual Studio is to break on unhandled errors in user code.",
      "PostedDate": "2010-08-31T10:22:04.983-07:00",
      "Id": 15622
    },
    {
      "Message": "for me i just change \"false\" to \"true\" and the validation works",
      "PostedDate": "2010-09-23T23:15:09.09-07:00",
      "Id": 16374
    }
  ]
}