[
  {
    "Id": "440935",
    "ThreadId": "212104",
    "Html": "<p>I've gone through tutorial v 0.8, and got my old editor pen. Here are the comments (pages are as in PDF; pagination in the document is off by 1):</p>\r\n<p>page 11: /App_Data is not created</p>\r\n<p>page 44: Public class StoreManagerController; not StoreController</p>\r\n<p>page 44: .Include(&quot;Genre&quot;).Include(&quot;Artist&quot;) is no longer necessary thanks to lazy loading that EF4 generates by default</p>\r\n<p>page 44: return View(albums); Of course, you can also use return View(storeDB.Albums) - and I would argue that it's a better approach - but the first operator (var albums =) is not necessary</p>\r\n<p>page 46: &quot;Create new album&quot; disappeared from the aspx code</p>\r\n<p>page 58: Create function should be public ActionResult Create([Bind(Prefix=&quot;Album&quot;)] Album album) - Bind is missing</p>\r\n<p>page 62: are you making AlbumMetaData an internal class intentionally? You do it twice; so I assume the answer is &quot;yes&quot; - but you don't explain why; and all other examples (ScottGu, Brad Wilson) don't use internal class.</p>\r\n<p>These are mostly simple errors. I have more general comments; but I'll save those for another post :)</p>",
    "PostedDate": "2010-05-09T22:20:29.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441319",
    "ThreadId": "212104",
    "Html": "<p>Thanks, @virshu. Will update with your fixes. A few places where things are written as intended:</p>\r\n<ul>\r\n<li>p. 44 - We're intentionally using eager loading rather than lazy loading of related entities for efficiency, since we know we will be retrieving related entities. This is more efficient since it allows EF to get everything in one database transaction rather than requiring two or more database trips</li>\r\n<li>p. 62 - Yes, I'm using internal classes. I had a long review meeting with Scott Guthrie and Scott Hanselman, and we all agreed that this format looked a little cleaner.</li>\r\n</ul>",
    "PostedDate": "2010-05-10T22:53:31.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]