[
  {
    "Id": "441411",
    "ThreadId": "212245",
    "Html": "<p>Hi John,<br>Nice tutorial overall. I hope you do plan to expand this&nbsp;with more advanced features in the near future. There are quite a few reference apps/open source MVC projects out there that show how to get started and build something simliar to what you have done. I would love to see someone tackle those more complex issues that are pretty common in real world apps, such as:</p>\r\n<ul>\r\n<li>Asynchronous opearations for sending emails, calling web services</li>\r\n<li>Extending a default membership service to include custom fields for registration </li>\r\n<li>More advanced&nbsp;forms and controls&nbsp;and how to handle input with those - I think showing how you render/post/validate listbox values for instance. Not just simple bind from the DB, but show how you prevent errors when users mock with the urls, how you handle multiple values&nbsp;selected for a&nbsp;given control,&nbsp;etc... </li>\r\n</ul>\r\n<p>Really not trying to take away from the excellent work you have done, I have been just looking for some guidance on how to handle some of those things properly.&nbsp;I&nbsp;could be wrong, but I am pretty sure I am not the only one...</p>",
    "PostedDate": "2010-05-11T04:02:07.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441542",
    "ThreadId": "212245",
    "Html": "<p>Thanks, Malcolm -</p>\r\n<p>Yes, I'm definitely planning on covering some more advanced features next, although it may be in a separate project as opposed to adding on to this one. Our feeling was that we had a few MVC tutorials which covered the intermediate to high-intermediate range (Nerd Dinner, MVC Storefront) but that we didn't have a good introductory tutorial that was approachable to beginners. But, you're right, we need to cover some of the more advanced &quot;real world&quot; scenarios, especially in light of some of the newer features like async controller actions. Please let me know if you think of any other scenarios you'd like covered.</p>",
    "PostedDate": "2010-05-11T08:33:42.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489818",
    "ThreadId": "212245",
    "Html": "<p>I'm looking for unit testing with MVC frameworks. Any chance the next version of the MVC storefront will have unit test samples?</p>",
    "PostedDate": "2010-09-06T12:07:07.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "495900",
    "ThreadId": "212245",
    "Html": "<p>(bump) Any chance you'll be using MSTest for unit tesitng?</p>",
    "PostedDate": "2010-09-20T03:52:19.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "497339",
    "ThreadId": "212245",
    "Html": "<p>Allen - We'll probably include unit tests in the download. James has prepared some (using MSTest) for Web Camps. The tutorial isn't being rewritten to be test-first, but we'll most likely have tests.</p>",
    "PostedDate": "2010-09-22T19:59:53.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "501744",
    "ThreadId": "212245",
    "Html": "<p>I've looked at Web Camps and I can't seem to find any MSTest examples or labs around unit testing. Any chance you could help point me in the right direction and find them?</p>",
    "PostedDate": "2010-10-03T14:01:23.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549547",
    "ThreadId": "212245",
    "Html": "\r\n<p>I've looked through the latest version of the MVC 3 tutorial and I'm not finding any MSTest Unit Tests in the document and or source. Are they located somewhere else?</p>\r\n",
    "PostedDate": "2011-01-14T11:30:47.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549584",
    "ThreadId": "212245",
    "Html": "\r\n<p>Allen - There is a testing lab using the MVC Music Store in the Web Camps Training Kit:&nbsp;<a href=\"http://trainingkit.webcamps.ms/AspNetMvc.htm\">http://trainingkit.webcamps.ms/AspNetMvc.htm</a>&nbsp;(look in the Intermediate level labs) which have an\r\n introduction to MSTest with ASP.NET MVC. Ideally I would like to extend and integrate this, but I haven't been able to get time for that so far. The top goal of this tutorial is to teach developers who are new to ASP.NET MVC how the different features work\r\n without completely overwhelming them, and so far testing has been outside that scope, at least for the main tutorial. Can you take a look at the Web Camps Testing tutorial and let me know what you think of it?</p>\r\n",
    "PostedDate": "2011-01-14T12:56:39.03-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "549896",
    "ThreadId": "212245",
    "Html": "\r\n<p>Thanks jon. I downloaded the september release of the web camps training kit&nbsp;from here:\r\n<a href=\"http://www.microsoft.com/downloads/en/details.aspx?FamilyID=0a906559-28bd-4f5d-ac18-f895a200a2a5\">\r\nhttp://www.microsoft.com/downloads/en/details.aspx?FamilyID=0a906559-28bd-4f5d-ac18-f895a200a2a5</a>&nbsp;and aparently that doesn't have the lab you speak of. I went to your link and found the lab. Is there a new downloadable version of the web camps coming\r\n that would include the lab? Its hard to keep track of the differences between the online web camps and the downloadable version. No matter I'll go through the lab and post my feedback. Thanks for the link!</p>\r\n",
    "PostedDate": "2011-01-15T10:54:57.377-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "554172",
    "ThreadId": "212245",
    "Html": "\r\n<p>First of all let me just say thanks tremendously for V1.0, it helped me understand MVC2 very quickly and easily.</p>\r\n<p>In V2.0, I can't understand why you are showcasing EFCodeFirst as THE data access method when it is still only in CTP phase?&nbsp;I noted that there are several references to MVC2 in the text&nbsp;that are clearly supposed to be MVC3. I assumethis means\r\n you probably had to rush a little to get this out with the MVC3 release, so are you planning any revisions&nbsp;that may&nbsp;hopefully explain a few alternatives to data access and some best practice recommendations. Or will there be a Patterns &amp; Practices\r\n release that addresses this?</p>\r\n",
    "PostedDate": "2011-01-23T22:45:16.46-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "554197",
    "ThreadId": "212245",
    "Html": "\r\n<p>TylerDurden (if that is your real name...) - We decided to use EF Code First since it allows us to focus on the web application rather than data access. This is an introductory tutorial, so simplicity is definitely a priority here. There are piles of tutorials\r\n demonstrating data access, including P&amp;P guides and whitepapers, but demonstrating a variety of alternatives isn't the goal here.&nbsp;Are you asking because you're looking for information?</p>\r\n<p>re: EF being in CTP -&nbsp;It's at CTP 5 and due out soon, and this is a tutorial on new software from Microsoft, so it was a bit of judgement call but it seemed to fit pretty well.&nbsp;</p>\r\n<p>re: references to MVC 2 - It's a long document (almost 20,000 words) so I definitely tried my best to make it error free, but I'm not shocked a few things slipped by. I'd be happy if you can point any specifics out to me.</p>\r\n",
    "PostedDate": "2011-01-24T00:10:28.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "570331",
    "ThreadId": "212245",
    "Html": "<p>Any possibility that this is going to be refreshed for MVC 3.0?</p>",
    "PostedDate": "2011-02-22T11:09:51.397-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "570356",
    "ThreadId": "212245",
    "Html": "<p>@AllenFeinberg - The MVC 3 update went out on the day MVC 3 shipped, back in January. It's the latest download.</p>",
    "PostedDate": "2011-02-22T11:52:51.907-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]