[
  {
    "Id": "473899",
    "ThreadId": "221750",
    "Html": "<p>Hi everyone.</p>\r\n<p>Thanks for this tutorial, it's very simple and good, but i'm having some problems.</p>\r\n<p>I'm using VS 2008 SP 1 with SQL 2005.</p>\r\n<p>First: when i try to use the code storeDB.Genre.Single(...) trhows an exception on runtime (not supported), then i have to change to First(...)</p>\r\n<p>Second: when i implemented the code to the Create action from StoreManager, the Artist and Genre of the Album are null, so it throws an exception when accessing the Create View. (Page 56)</p>\r\n<p>Third: after make some changes related to fix the previous problem, the new Album created is not loading the Artist.Name and Genre.Name data, throwing an exception when trying to truncate them (using the helper).</p>\r\n<p>Anyone knows why those errors are happening?</p>\r\n<p>bye</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-28T14:26:14.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "474102",
    "ThreadId": "221750",
    "Html": "<p>I don't think that Sql 2005 can attach the datasource file(.mdf).</p>\r\n<p>Besides,Are you using Linq to Sql or Linq to Entities?</p>",
    "PostedDate": "2010-07-29T01:57:33.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "474190",
    "ThreadId": "221750",
    "Html": "<p>Hi. Thanks for your reply.</p>\r\n<p>The database is fine. I used the generation script provided on the source code to create the database, and it's working fine.</p>\r\n<p>I figured out now that when i added the album, a new genre and artist were created... probably the entity framework has done something i wasn't expecting...</p>\r\n<p>Any ideas?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-29T04:54:21.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "474235",
    "ThreadId": "221750",
    "Html": "<p>Another thing: Html.EditorFor is generating the makup of the fieldset and the submit button, which means that there are 2 buttons and 2 fieldsets on my edit/create views</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-29T06:10:34.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]