[
  {
    "Id": "500708",
    "ThreadId": "229210",
    "Html": "<p>I am a total noob, so sorry if this is a dumb question...</p>\r\n<p>On page 29, the instruction is:</p>\r\n<p>&quot;We&rsquo;ll start by adding a using MvcMusicStore.Models statement to the using statements list at the top of the controller, then modify the Browse and Details methods to appear as follows:&quot;</p>\r\n<p>However, the instructions don't specify which controller is &quot;the&quot; controller. &nbsp;At this point, no Browse or Details methods have been set up either, as far as I can tell. &nbsp;</p>\r\n<p>Do I need to set up a new controller to do this? &nbsp;Should I be adding that section to the StoreBrowseViewModel page? &nbsp;(That doesn't seem right, but the instructions are directly beneath this section.) &nbsp;If yes to this, then where would the changes go on this page?</p>\r\n<p>Thank you for the help!</p>",
    "PostedDate": "2010-09-30T14:11:57.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500756",
    "ThreadId": "229210",
    "Html": "<p>This is in the StoreController which we created on page 14. The Browse and Details methods were added there as well.</p>",
    "PostedDate": "2010-09-30T17:11:50.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500763",
    "ThreadId": "229210",
    "Html": "<p>Aha... so on page 24, when I was instructed to:</p>\r\n<p>&quot;...change the StoreController&rsquo;s Index action method to return that ViewModel&quot; I wasn't supposed to replace EVERYTHING with the coding written there. &nbsp;I see, OK. &nbsp;That was completely unclear, so I replaced both the Browse and Details methods with what was shown to me. &nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Separate question... I ran into a problem on page 26 - at the top of the page, it shows how my page should look when I add &quot;NumberOfGenres&quot; between &lt;%:%&gt;</p>\r\n<p>Then, it tells me to add a foreach loop but, at the bottom of the page it shows what my template is supposed to look like, and it's not the same as the top at all. &nbsp;</p>\r\n<p>Where the NumberOfGenres diagram is it shows &quot;&lt;h2&gt;Store Name&lt;/h2&gt;&quot;, but the completed diagram shows &quot;&lt;h3&gt;Browse Genres&lt;/h3&gt;&quot;</p>\r\n<p>So, I replaced&nbsp;&lt;h2&gt;Store Name&lt;/h2&gt; with&nbsp;&lt;h3&gt;Browse Genres&lt;/h3&gt;. &nbsp;And I replaced &lt;p&gt;Browsing &lt;%: Model.NumberOfGenres%&lt;/p&gt; with &lt;p&gt;Select from &lt;%: Model.NumberOfGenres %&gt; genres:&lt;/p&gt;. &nbsp;Is that correct?</p>",
    "PostedDate": "2010-09-30T17:38:46.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]