[
  {
    "Id": "509562",
    "ThreadId": "231534",
    "Html": "<p><span style=\"font-size:x-small\"><span style=\"font-size:x-small\"><span><span style=\"font-size:x-small\"><span style=\"font-size:x-small\"><span><span style=\"font-size:medium\">\r\n<p>Hi,</p>\r\n<p>I've followed the tutorial up to Part 4 and it has been very detailed, accurate and well-composed. However, I'm having some issues with the database connection to MvcMusicStore.mdb and I'm wondering if I'm missing a step so obvious to most that is was left out of the instructions.</p>\r\n<p>After adding the ADO.NET Entity Data Model and selecting &quot;Generate from database&quot; &gt; Next, I have the same result as your &quot;Choose Your Data Connection&quot; screenshot. &quot;MvcMusicStore.mdb&quot; is in the combobox and is also added as a new database connection to my Server Explorer window under Data Connections. Entity connection string is:</p>\r\n<p>metadata=res://*/Models.StoreDB.csdl|res://*/Models.StoreDB.ssdl|res://*/Models.StoreDB.msl;provider=System.Data.SqlClient;provider connection string=&quot;Data Source=.\\SQLEXPRESS;AttachDbFilename=|DataDirectory|\\MvcMusicStore.mdf;Integrated Security=True;User Instance=True&quot;</p>\r\n<p>After changing &quot;MvcMusicStoreEntities&quot; to &quot;MusicStoreEntities&quot;, I click Next and get the following error: &quot;An error occurred while connecting to the database. The database might be unavailable. An exception of type 'System.Data.SqlClient.SqlException' occurred. The error message is: 'Failed to generate a user instance of SQL Server due to a failure in starting the process for the user instance. The connection will be closed.'.&quot;</p>\r\n<p>After some experimenting I'd like to make the following observations - please don't hesitate to correct me on these:</p>\r\n<p>1) The &quot;|DataDirectory|&quot; in the wizard-generated connection string refers to the DATA folder for the SQLServer instance, not the App_Data folder in the Project.</p>\r\n<p>2) If I click &quot;New Connection...&quot; I can step through the Connection Properties dialog, select Attach a database file&quot; and browse to MvcMusicStore.mdb to get that path in the connection string, but then I get all kinds of errors - I think SQLServer only wants to deal with mdb files inside its DATA folder.</p>\r\n<p>3) I copy the MvcMusicStore.mdb files into the SqlServer DATA folder. Go back to the wizard, click Next - still no joy.</p>\r\n<p>4) I click New Connection... to open the Connection Properties dialog and select &quot;Attach a database file&quot; again - only this time I select the MvcMusicStore.mdb file I just added. Close, and a new connection is in the combo box and Server Explorer: &quot;MvcMusicStore1&quot;. Click Next and voila! I'm connected and I see the Database Objects in the next wizard page!</p>\r\n<p>(Now my connection string is: metadata=res://*/Models.StoreDB.csdl|res://*/Models.StoreDB.ssdl|res://*/Models.StoreDB.msl;provider=System.Data.SqlClient;provider connection string='Data Source=FALCON\\SQLEXPRESS;AttachDbFilename=&quot;C:\\Program Files\\Microsoft SQL Server\\MSSQL10_50.SQLEXPRESS\\MSSQL\\DATA\\MvcMusicStore.mdf&quot;;Initial Catalog=MvcMusicStore;Integrated Security=True')</p>\r\n<p>5) When I check the MSSMS a new database is there: MvcMusicStore&quot;.</p>\r\n<p>So my bottom line question is: is it possible to use EF4 to connect directly to and open an mdb file inside a project folder without adding the MDB to the SqlServer DATA folder? If so, what am I missing?</p>\r\n<p>(Sorry this was so long-winded.)</p>\r\n</span>\r\n<p><span style=\"font-size:x-small\"><span style=\"font-size:x-small\"><span><span style=\"font-size:x-small\"><span style=\"font-size:x-small\"><span>&nbsp;</span></span></span></span></span></span></p>\r\n</span></span></span></span></span></span></p>",
    "PostedDate": "2010-10-19T12:18:01.843-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "511073",
    "ThreadId": "231534",
    "Html": "\r\n<p>I thought I'd follow up on this issue with what I've recently learned.</p>\r\n<p>None of this info will be new to ASP.NET coders with a lot of past experience with SQL Server, but for us novices it may shed some light on some issues with this otherwise excellent tutorial.</p>\r\n<p>With SQL Server Express 2005 it WAS possible to read MDB files without first creating a database from them: they were called &quot;user instances&quot; and required that the User Instance value in the connection string be set to True.</p>\r\n<p>However that feature was dropped and is not available in SQL Server Express 2008. So for this tutorial, the MDB does need to be attached and loaded into the master catalog.</p>\r\n<p>As far as the use of EF4 in the tutorial, the exercise becomes a &quot;Database First&quot; method to build the entities and use LinQ to Entities (which still has some value as a path to choose).</p>\r\n<p>One thing that confused me on top of not being able to connect to the MDB file was that a connection string to the MDB kept appearing in my Server Explorer pane and would of course error because it couldn't connect to a real database in the master catalog.\r\n I discovered that VS has a feature of automatically creating a connection string for any MDB inside App_Data.</p>\r\n<p>So removing the MDB file from App_Data (after manually loading it into SQL Server and then creating the ADO.NET Entity Data Model from the Database) seemed to resolve the issues.</p>\r\n",
    "PostedDate": "2010-10-22T06:22:44.087-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "512440",
    "ThreadId": "231534",
    "Html": "\r\n<p>Thanks for following up, and glad you got it sorted out, Wayne. Two minor things to add:</p>\r\n<ul>\r\n<li>SQL Server data files are MDF files, not MDB. MDB is the file extension file extension used for Access database files. You'll notice if you look at your connection string that it's pointing to MvcMusicStore.mdf.\r\n</li><li>One other option you've got if you're having trouble with user instances is to run the SQL create scripts against a local database instance of SQL Server 2005 or SQL Server 2008.\r\n</li></ul>\r\n",
    "PostedDate": "2010-10-25T16:16:12.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "512484",
    "ThreadId": "231534",
    "Html": "\r\n<div>Jon,</div>\r\n<div>&nbsp;</div>\r\n<div>Sorry, I meant MDFs. I had to deal with Access on my former job and I still have nightmares about that.</div>\r\n<div>&nbsp;</div>\r\n<div>One other problem I had was with the Authorization database area.</div>\r\n<div>&nbsp;</div>\r\n<div>In addition to copying the files you described, you also need to copy some settings in the web.config file of the MVC app created from the full MVC2 web app template:</div>\r\n<div><span style=\"font-family:Segoe UI; color:#30332d\">&lt;membership&gt;, &lt;profile&gt; and &lt;rolemanager&gt; nodes.</span></div>\r\n<div>&nbsp;</div>\r\n<div><span style=\"font-family:Segoe UI; color:#30332d\">Even after copying these I still had problems with the ASP.NET Configuration website&nbsp;&ndash; the Security tab kept throwing me into the Provider tab. It couldn&rsquo;t recognize the database.</span></div>\r\n<div><span style=\"font-family:Segoe UI; color:#30332d\">I went to <span style=\"font-family:Courier New\">\r\n<span style=\"color:#000000\"><span style=\"font-size:x-small\"><span style=\"font-family:Courier New\"><span style=\"color:#000000\">[%system root%]\\Microsoft.NET\\Framework\\versionNumber\\aspnet_regsql.exe\r\n<span style=\"font-family:Segoe UI; font-size:x-small\"><span style=\"font-size:small\">and ran the database wizard. Then I created the following connection string and added it to my web.config</span>\r\n</span></span></span></span></span></span></span>&lt;add name=&quot;ApplicationServices&quot;</div>\r\n<div>&nbsp;&nbsp;&nbsp;&nbsp; connectionString=&quot;Data Source=FALCON\\SQLEXPRESS;Initial Catalog=aspnetdb;Integrated Security=True&quot; providerName=&quot;System.Data.SqlClient&quot; /&gt;</div>\r\n<div>and the Configuration website started working correctly.</div>\r\n<div>&nbsp;</div>\r\n<div>Hope this helps.</div>\r\n",
    "PostedDate": "2010-10-25T20:04:33.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]