[
  {
    "Id": "591205",
    "ThreadId": "252394",
    "Html": "\r\n<p>I am following this tutorial on Windows XP. VS 2010 and tutorial guide were downloaded just today so I assume I'm getting the latest versions.</p>\r\n<p>All went swimmingly until Part 4</p>\r\n<h3>Use NuGet to install EFCodeFirst</h3>\r\n<p>When I tried to add the library package reference an error message popped up, which I failed to record. Then I tried the Package manager console and got a message that I needed to install PowerShell.</p>\r\n<p>I did that as instructed and tried again to add the library package reference. This time the dialog box appeared as shown. I searched for EfCodeFirst and its description states that this is legacy code and is now a part of EntityFramework. I tried to install\r\n (1) EfCodeFirst and then (2) EntityFramework. Both times I got a message that the package contains PowerShell scripts and I have to use the Package Manager Console to install the package.</p>\r\n<p>So please:</p>\r\n<p>(1) State that PowerShell is a pre-requisite for running the tutorial.</p>\r\n<p>(2) Give us a PowerShell script to do the install.</p>\r\n",
    "PostedDate": "2011-04-04T03:18:21.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591261",
    "ThreadId": "252394",
    "Html": "<p>The solution turned out to be surprisingly easy.</p>\r\n<p>Instead of the method described in the tutorial do as follows:</p>\r\n<p>Install Powershell for your OS, if not already done.</p>\r\n<p>In the solution, click on Tools/Library package Manager/Package Manager Console</p>\r\n<p>After the PM&gt; prompt type</p>\r\n<p>Install-Package EfCodeFirst</p>\r\n<p>The package gets installed, reading the log file shows that EfCodeFirst is obsolete and EntityFramework was installed instead.</p>\r\n<p>Close the console window.</p>\r\n<p>Look at Reference in the Solution Explorer, you should see EntityFramework there.</p>",
    "PostedDate": "2011-04-04T05:35:02.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591457",
    "ThreadId": "252394",
    "Html": "<p>@dhenry - Yes, the EFCodeFirst package was replaced by the EntityFramework package. I'm including that change in the next update, changing and will change this to a work item to track it. Thanks for posting the solution so other people can benefit.</p>",
    "PostedDate": "2011-04-04T11:05:23.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591460",
    "ThreadId": "252394",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://mvcmusicstore.codeplex.com/workitem/6634\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2011-04-04T11:06:16.997-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]