[
  {
    "Id": "594169",
    "ThreadId": "253105",
    "Html": "<p>I wanted to bring up a discussion about browser issues I am having with the MVC Music Store tutorial. I am on page 26 of the pdf, and I am just at the point where I have dropped the image resources and site.css file into my project. When I ran the project  as the tutorial suggested, my site did not reflect the image in the tutorial. There were no images on my site, just straight html header and unordered list. I got to thinking about browser differences and how I was using FireFox 4.0, so I switched to IE9.  This was better - I had the music store logo at the top left of my screen, but my unordered list was directly to the right of it, one on top of the other, and they were orange. Finally, I switched to Chrome 10.0.648.204, and this was the only browser that  reflected what the tutorial showed the site should look like.</p>\n<p>&nbsp;</p>\n<p>What is the difference in how these browsers are rendering this content that cause only chrome to display the content correctly? Can we work through getting the content to display correctly in all three browsers? I understand this is a common problem with  web dev, and it would be nice to get some insight about it in relation to this tutorial specifically. Thanks.</p>\n<p>UPDATE: Ok, so the issue with Firefox was my own stupidity. It was caching the pages from previously running the project. I ctrl-F5 and it reloaded the content correctly. The issue persists with IE9 however. I have narrowed the problem down to the navlist specifically. Something in the CSS that IE9 doesn't recognize???</p>",
    "PostedDate": "2011-04-08T07:10:02.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "680609",
    "ThreadId": "253105",
    "Html": "<p>It's a bug in IE9. Use the compatibility widget on IE9 or use FF or Chrome.&nbsp; - Rick Anderson - Microsoft</p>",
    "PostedDate": "2011-10-05T18:00:53.583-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "724685",
    "ThreadId": "253105",
    "Html": "<p>Hi,</p>\r\n<p>I have completed &nbsp;MVC2.1 tutorial and having browser&nbsp;compatibility&nbsp;issue in Firefox.</p>\r\n<p>None of the website contents can be displayed. Whereas in Chrome its working perfectly fine.</p>\r\n<p>There are some minor problems with the \"fieldset\" and \"legend\" in IE9 but that shouldn't matter.</p>\r\n<p>What do i need to change in CSS for the contents to be displayed in Firefox?</p>",
    "PostedDate": "2012-01-13T02:47:00.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]