[
  {
    "Id": "602209",
    "ThreadId": "255122",
    "Html": "\r\n<p>In version 3.0 beta of the tutorial we add the StoreManagerController using Visual Studio to create the CRUD methods.</p>\r\n<p>As part of this Dispose is created, however there's no mention of this within the tutorial, and would assume it would mentioned if it were a good practice.</p>\r\n<p>Google is returning conflicting information, so ... should Dispose be implemented on all of the controllers, or not?</p>\r\n",
    "PostedDate": "2011-04-24T15:02:09.287-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "604970",
    "ThreadId": "255122",
    "Html": "<p>The word I've gotten is that adding Dispose is a best practice since it will free up your connection as soon as possible, although I've seen conflicting information about how important that is. The controller that's created by the scaffold (StoreManagerController) generates that code, so I left it in, but I didn't think it was necessary to add it to the other controllers.</p>\r\n<p>Getting the balance of best practice vs. simple tutorial is tricky. If this tutorial tried to cover every best practice, it would either be 500+ pages or wouldn't be published yet because I couldn't get everyone to agree on what the best practice is. I'm checking with the EF team to find out if they think this is important enough that it needs to be covered here.</p>",
    "PostedDate": "2011-04-29T10:46:24.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "605227",
    "ThreadId": "255122",
    "Html": "<p>True enough, but I'd argue that ensuring you're not keeping database connections open is, by far, one of the most important lessons to be taught (I might argue essential, even), as it's one of the biggest things beginners don't realize.</p>\r\n<p>But, I might be bias. I didn't learn about&nbsp;using statements until a number of months into writing code, after reading a slew of tutorials that didn't make a single mention of them. Resource management just isn't mentioned as much as it should be in the majority of other tutorials, in my opinion ...</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for the checking with the EF team. I'd be interested in hearing what they say, so I can update my own production code accordingly. (My research before posting the question suggested that the EF is better at managing the connections, and therefore the dispose wasn't necessary - period - in these cases.)</p>",
    "PostedDate": "2011-04-30T05:37:59.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]