[
  {
    "Id": "602181",
    "ThreadId": "255115",
    "Html": "\r\n<p>I'm working through version 3.0 of the guide, which uses SQL Compact Edition. However, since the membership database is still stored in, and using, SQL Server Express, and it doesn't appear that it's just as simple as switching this over to Compact Edition,\r\n it appears that Express is still required for the tutorial.</p>\r\n<p>Is this not the case (can we use SQL Compact Edition instead), or is this an oversight in the guide, since we generally have Express installed anyways?</p>\r\n<p>Thanks.</p>\r\n",
    "PostedDate": "2011-04-24T12:52:24.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "602443",
    "ThreadId": "255115",
    "Html": "<p>My understanding is that SQL Server Express Edition (or higher) is still required. This is because the MembershipProvider makes extensive use of stored procedures, which are not supported in SQL Compact Edition.</p>",
    "PostedDate": "2011-04-25T08:21:32.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "602579",
    "ThreadId": "255115",
    "Html": "<p>Yes, both SQL Server Express an SQL Server Compact are used - Express for the membership database, and Compact for the application database. Both will be already be installed if you're following the required software list at the beginning of the tutorial.</p>\r\n<p>This isn't an oversight, it was an intentional choice. As yeurch noted, the membership database doesn't work with SQL Server Compact, but I wanted to use compact for the application database since (1) it works more smoothly with EF Code First (2) a lot of the problems users were running into in earlier versions of the tutorial were in setting up the SQL Express database, connection string, etc. It's already configured for the membership database, but can be tricky to set up for beginners. EF auto-creates the SQL Compact file for you, so it's a lot less error prone.</p>",
    "PostedDate": "2011-04-25T12:47:42.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "602658",
    "ThreadId": "255115",
    "Html": "<p>True enough. It's just the guide states \"We&rsquo;ll be using the SQL Server Compact (also free) to host the database.\"</p>\r\n<p>Since some users may be pushing this out to a server, either before or after they tweak it to their own needs, it might be worth making <em>some</em> mention of SQL Express, even if it's just in passing in Part 7 / Membership and Authorization.</p>\r\n<p>(And for those intermediate users reviewing the tutorial to see if it effectively negates the need for beginner's ASP.NET MVC books, you don't get their hopes up that Compact Edition can now handle membership. ;) )</p>",
    "PostedDate": "2011-04-25T18:46:33.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "602672",
    "ThreadId": "255115",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://mvcmusicstore.codeplex.com/workitem/6647\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2011-04-25T19:58:48.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]