[
  {
    "Id": "659212",
    "ThreadId": "269343",
    "Html": "\r\n<div>\r\n<p>Hey guys, everything has worked up to this point in the tutorial. When I overlay the original, ( I DID SAVE A COPY\r\n<span style=\"font-family:Wingdings\">J</span>) and run the appl., the home-showcase, logo, & placeholder does not appear at the top of my screen? Well a good education comes if you know the use of “ID” & “Class” The ID gives a unique Identity to the html tags\r\n while Class allows you to pull information from the .css file configuration. When I applied the class= parm to the html tags, everything worked as expected.\r\n</p>\r\n<p></p>\r\n<p>I mentioned this because nothing in the tutorial explains what needs to happen before you get a successful display. Also a reminder explanation of the\r\n<a href=\"&lt;span\" style=\"color:red\">”/Store/” statement and how it interacts with the current StoreController could clear up some questions about the error “File ‘/Store’ was not found”\r\n<span style=\"color:#4F81BD\">context message</span> appears in the _Layout file.</p>\r\n<p></p>\r\n<p>Thanks for the insightful tutorial</p>\r\n<p></p>\r\n<p>Tom Johnson</p>\r\n</div>\r\n</a>",
    "PostedDate": "2011-08-16T21:37:25.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "664368",
    "ThreadId": "269343",
    "Html": "<p>The same thing happened to me until I realized that I did not enclose the \"ASP.NET MVC MUSIC STORE\" text within&nbsp; h1 tags.&nbsp; Once I did that, the logo appeared just like the screen shot showed on page 31.&nbsp; The .css file added the logo image so it would appear above the header text.</p>",
    "PostedDate": "2011-08-27T22:45:06.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "667019",
    "ThreadId": "269343",
    "Html": "<p>Tom, I'm not clear on which class you needed to apply. As long as you set the ID for the header as shown in the sample code directly before \"Updating the Style Sheet\" then you shouldn't need to set any additional classes. The header styles are all set using the header ID, e.g. #header, #header h1, etc.</p>",
    "PostedDate": "2011-09-02T14:24:31.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]